[
  {"term": "P/E ratio", "definition": "Price-to-Earnings ratio: the price you pay for $1 of a company’s yearly profit (price per share ÷ earnings per share)."},
  {"term": "ROI", "definition": "Return on Investment: how much you gained (or lost) relative to what you put in. Formula: (gain - cost) / cost × 100%."},
  {"term": "Mutual Funds", "definition": "A pool of many investors’ money managed by a professional that buys a mix of stocks, bonds, or other assets — good for instant diversification."},
  {"term": "ETF", "definition": "Exchange-Traded Fund: like a mutual fund but trades on an exchange like a stock; usually has lower fees and intraday trading."},
  {"term": "Index Fund", "definition": "A fund (mutual or ETF) that copies an index (e.g., S&P 500) to provide broad, low-cost market exposure."},
  {"term": "Market Capitalization", "definition": "Total value of a company’s shares = share price × number of shares. Used to classify companies by size (large/mid/small cap)."},
  {"term": "Dividend", "definition": "A portion of a company’s profits paid to shareholders, often on a regular schedule (cash payments)."},
  {"term": "Dividend Yield", "definition": "Annual dividends per share ÷ current share price; shows income relative to the price (e.g., 3% yield)."},
  {"term": "Capital Gain / Loss", "definition": "Profit (gain) or loss from selling an investment for more or less than you paid."},
  {"term": "Compound Interest", "definition": "Earnings on both the money you invested and on the earned interest/gains — growth on growth over time."},
  {"term": "Asset Allocation", "definition": "How you split your money among asset types (stocks, bonds, cash); a key driver of long-term risk and return."},
  {"term": "Diversification", "definition": "Spreading investments across different assets to reduce risk — don't put all your eggs in one basket."},
  {"term": "Volatility", "definition": "How much an investment's price swings; higher volatility = bigger short-term ups and downs."},
  {"term": "Liquidity", "definition": "How quickly and cheaply an asset can be sold for cash; high liquidity = easy to sell with low cost."},
  {"term": "Bull Market", "definition": "A market where prices are generally rising and investor sentiment is optimistic."},
  {"term": "Bear Market", "definition": "A market where prices are generally falling and investor sentiment is pessimistic."},
  {"term": "Bond", "definition": "A loan you give to a government or company; they pay interest (coupon) and return principal at maturity."},
  {"term": "Coupon", "definition": "The fixed interest payment a bond makes, typically expressed as a percentage of the bond's face value."},
  {"term": "Yield to Maturity (YTM)", "definition": "The annual return you'd get if you held a bond to maturity, accounting for current price and coupon payments."},
  {"term": "Credit Rating", "definition": "An agency's opinion of a borrower's likelihood to repay; higher ratings indicate lower default risk."},
  {"term": "Expense Ratio", "definition": "Annual fee (as a % of assets) charged by a fund for management and operations — lower is generally better."},
  {"term": "NAV", "definition": "Net Asset Value: per-share value of a mutual fund (assets − liabilities) / shares outstanding."},
  {"term": "Beta", "definition": "A measure of how much a stock tends to move with the overall market. Beta > 1 = more sensitive; Beta < 1 = less sensitive."},
  {"term": "Alpha", "definition": "The extra return an investment gives compared to what would be expected from its beta (a measure of outperformance)."},
  {"term": "Fundamental Analysis", "definition": "Studying a company's financials, business model, and industry to estimate its fair value for investing."},
  {"term": "Technical Analysis", "definition": "Analyzing price charts and patterns to predict short-term moves — used mainly by traders."},
  {"term": "Margin", "definition": "Borrowing money from a broker to buy investments; increases potential gains and losses (riskier)."},
  {"term": "Short Selling", "definition": "Betting a stock will fall: borrow shares, sell now, and buy back later at a (hopefully) lower price."},
  {"term": "Dollar-Cost Averaging", "definition": "Investing a fixed amount regularly; buys more when prices are low and less when prices are high, smoothing timing risk."},
  {"term": "Inflation", "definition": "The general rise in prices over time; reduces money's purchasing power — investments should aim to outpace inflation."},
  {"term": "Rebalance", "definition": "Adjusting your portfolio back to target allocation by selling overweight assets and buying underweight ones."},
  {"term": "IPO", "definition": "Initial Public Offering: when a private company first sells shares to the public; can be volatile and risky."},
  {"term": "Tax-Loss Harvesting", "definition": "Selling losing investments to realize losses that offset taxable gains and potentially lower taxes."}
]
